//
//  Hangul.swift
//  CustomKeyboard
//
//  Created by CHUBBY on 2022/07/18.
//

import Foundation

// onset (초성)
let choArray:[String] = ["ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]

// nucleus (중성)
let jungArray:[String] = ["ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"]

// coda (종성)
let jongArray:[String] = [" ", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]

// doubleOnset
var doubleChoArray : [(String, String, String)] =  [
    ("ㄱ","ㄱ","ㄲ"),
    ("ㄷ","ㄷ","ㄸ"),
    ("ㅂ","ㅂ","ㅃ"),
    ("ㅅ","ㅅ","ㅆ"),
    ("ㅈ","ㅈ","ㅉ")
]

// doubleNucleus
var doubleJungArray : [(String, String, String)] =  [
    ("ㅏ","ㅣ","ㅐ"),
    ("ㅑ","ㅣ","ㅒ"),
    ("ㅓ","ㅣ","ㅔ"),
    ("ㅕ","ㅣ","ㅖ"),
    ("ㅗ","ㅏ","ㅘ"),
    ("ㅗ","ㅐ","ㅙ"),
    ("ㅗ","ㅣ","ㅚ"),
    ("ㅜ","ㅓ","ㅝ"),
    ("ㅜ","ㅔ","ㅞ"),
    ("ㅜ","ㅣ","ㅟ"),
    ("ㅡ","ㅣ","ㅢ")
]

// doubleCoda
var doubleJongArray : [(String, String, String)] =  [
    ("ㄱ","ㄱ","ㄲ"),
    ("ㄱ","ㅅ","ㄳ"),
    ("ㄴ","ㅈ","ㄵ"),
    ("ㄴ","ㅎ","ㄶ"),
    ("ㄹ","ㄱ","ㄺ"),
    ("ㄹ","ㅁ","ㄻ"),
    ("ㄹ","ㅂ","ㄼ"),
    ("ㄹ","ㅅ","ㄽ"),
    ("ㄹ","ㅌ","ㄾ"),
    ("ㄹ","ㅍ","ㄿ"),
    ("ㄹ","ㅎ","ㅀ"),
    ("ㅂ","ㅅ","ㅄ"),
    ("ㅅ","ㅅ","ㅆ")
]
